atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/gpio_driver.c
/*
 * This file is part of AtomVM.
 *
 * Copyright 2017 Davide Bettio <davide@uninstall.it>
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *    http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * SPDX-License-Identifier: Apache-2.0 OR LGPL-2.1-or-later
 */

#include <sdkconfig.h>
#if defined(CONFIG_AVM_ENABLE_GPIO_PORT_DRIVER) || defined(CONFIG_AVM_ENABLE_GPIO_NIFS)

#include <stdbool.h>
#include <string.h>

#include <driver/gpio.h>

#include <freertos/FreeRTOS.h>
#include <freertos/task.h>

#include "atom.h"
#include "bif.h"
#include "context.h"
#include "debug.h"
#include "defaultatoms.h"
#include "globalcontext.h"
#include "interop.h"
#include "mailbox.h"
#include "module.h"
#include "nifs.h"
#include "platform_defaultatoms.h"
#include "port.h"
#include "scheduler.h"
#include "term.h"
#include "utils.h"

#include "trace.h"

#include "esp32_sys.h"
#include "esp_log.h"
#include "sys.h"

#define TAG "gpio_driver"

#ifdef CONFIG_AVM_ENABLE_GPIO_NIFS
static const struct Nif *gpio_nif_get_nif(const char *nifname);
#endif

#ifdef CONFIG_AVM_ENABLE_GPIO_PORT_DRIVER
static void gpio_driver_init(GlobalContext *global);
static NativeHandlerResult consume_gpio_mailbox(Context *ctx);
static void gpio_isr_handler(void *arg);
static Context *gpio_driver_create_port(GlobalContext *global, term opts);
#endif

static const AtomStringIntPair pin_mode_table[] = {
    { ATOM_STR("\x5", "input"), GPIO_MODE_INPUT },
    { ATOM_STR("\x6", "output"), GPIO_MODE_OUTPUT },
    { ATOM_STR("\x9", "output_od"), GPIO_MODE_OUTPUT_OD },
    SELECT_INT_DEFAULT(-1)
};

static const AtomStringIntPair pull_mode_table[] = {
    { ATOM_STR("\x2", "up"), GPIO_PULLUP_ONLY },
    { ATOM_STR("\x4", "down"), GPIO_PULLDOWN_ONLY },
    { ATOM_STR("\x7", "up_down"), GPIO_PULLUP_PULLDOWN },
    { ATOM_STR("\x8", "floating"), GPIO_FLOATING },
    SELECT_INT_DEFAULT(-1)
};

enum gpio_pin_level
{
    GPIOPinInvalid = -1,
    GPIOPinLow = 0,
    GPIOPinHigh = 1
};

static const AtomStringIntPair pin_level_table[] = {
    { ATOM_STR("\x3", "low"), GPIOPinLow },
    { ATOM_STR("\x4", "high"), GPIOPinHigh },
    SELECT_INT_DEFAULT(GPIOPinInvalid)
};

static const AtomStringIntPair int_trigger_table[] = {
    { ATOM_STR("\x4", "none"), GPIO_INTR_DISABLE },
    { ATOM_STR("\x6", "rising"), GPIO_INTR_POSEDGE },
    { ATOM_STR("\x7", "falling"), GPIO_INTR_NEGEDGE },
    { ATOM_STR("\x4", "both"), GPIO_INTR_ANYEDGE },
    { ATOM_STR("\x3", "low"), GPIO_INTR_LOW_LEVEL },
    { ATOM_STR("\x4", "high"), GPIO_INTR_HIGH_LEVEL },
    SELECT_INT_DEFAULT(GPIO_INTR_MAX)
};

enum gpio_cmd
{
    GPIOInvalidCmd = 0,
    GPIOSetLevelCmd,
    GPIOReadCmd,
    GPIOSetDirectionCmd,
    GPIOSetIntCmd,
    GPIORemoveIntCmd,
    GPIOCloseCmd
};

#ifdef CONFIG_AVM_ENABLE_GPIO_PORT_DRIVER
static const AtomStringIntPair gpio_cmd_table[] = {
    { ATOM_STR("\x9", "set_level"), GPIOSetLevelCmd },
    { ATOM_STR("\x4", "read"), GPIOReadCmd },
    { ATOM_STR("\xD", "set_direction"), GPIOSetDirectionCmd },
    { ATOM_STR("\x7", "set_int"), GPIOSetIntCmd },
    { ATOM_STR("\xA", "remove_int"), GPIORemoveIntCmd },
    { ATOM_STR("\x5", "close"), GPIOCloseCmd },
    SELECT_INT_DEFAULT(GPIOInvalidCmd)
};

static term gpio_driver;
#endif

struct GPIOListenerData
{
    struct ListHead gpio_listener_list_head;
    EventListener listener;
    int32_t target_local_pid;
    int gpio;
};

struct GPIOData
{
    struct ListHead gpio_listeners;
};

static bool term_is_logic_level(term level)
{
    bool result = false;
    if (level == LOW_ATOM) {
        result = true;
    }
    if (level == HIGH_ATOM) {
        result = true;
    }
    if (term_is_integer(level)) {
        switch (term_to_int(level)) {
            case 0:
                result = true;
                break;
            case 1:
                result = true;
                break;
            default:
                result = false;
        }
    }
    return result;
}

static inline term gpio_set_pin_mode(Context *ctx, term gpio_num_term, term mode_term)
{
    gpio_num_t gpio_num;
    if (LIKELY(term_is_integer(gpio_num_term))) {
        avm_int_t pin_int = term_to_int32(gpio_num_term);
        if (UNLIKELY((pin_int < 0) || (pin_int >= GPIO_NUM_MAX))) {
            return BADARG_ATOM;
        }
        gpio_num = (gpio_num_t) pin_int;
    } else {
        return BADARG_ATOM;
    }

    avm_int_t mode = interop_atom_term_select_int(pin_mode_table, mode_term, ctx->global);
    if (UNLIKELY(mode < 0)) {
        return BADARG_ATOM;
    }
    esp_err_t result = gpio_set_direction(gpio_num, (gpio_mode_t) mode);

    if (UNLIKELY(result != ESP_OK)) {
        return BADARG_ATOM;
    }

    return OK_ATOM;
}

static avm_int_t get_pull_mode(Context *ctx, term pull)
{
    return interop_atom_term_select_int(pull_mode_table, pull, ctx->global);
}

static inline term set_pin_pull_mode(Context *ctx, term gpio_num_term, term pull)
{
    gpio_num_t gpio_num;
    if (LIKELY(term_is_integer(gpio_num_term))) {
        avm_int_t pin_int = term_to_int32(gpio_num_term);
        if (UNLIKELY((pin_int < 0) || (pin_int >= GPIO_NUM_MAX))) {
            return BADARG_ATOM;
        }
        gpio_num = (gpio_num_t) pin_int;
    } else {
        return BADARG_ATOM;
    }

    avm_int_t pull_mode = get_pull_mode(ctx, pull);
    if (UNLIKELY(pull_mode < 0)) {
        return BADARG_ATOM;
    }

    esp_err_t result = gpio_set_pull_mode(gpio_num, (gpio_pull_mode_t) pull_mode);
    if (UNLIKELY(result != ESP_OK)) {
        return BADARG_ATOM;
    }
    return OK_ATOM;
}

static inline term hold_en(term gpio_num_term)
{
    gpio_num_t gpio_num;
    if (LIKELY(term_is_integer(gpio_num_term))) {
        avm_int_t pin_int = term_to_int32(gpio_num_term);
        if (UNLIKELY((pin_int < 0) || (pin_int >= GPIO_NUM_MAX))) {
            return BADARG_ATOM;
        }
        gpio_num = (gpio_num_t) pin_int;
    } else {
        return BADARG_ATOM;
    }

