atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/gpio_driver.c
    esp_err_t result = gpio_hold_en(gpio_num);
    if (UNLIKELY(result != ESP_OK)) {
        return BADARG_ATOM;
    }
    return OK_ATOM;
}

static inline term hold_dis(term gpio_num_term)
{
    gpio_num_t gpio_num;
    if (LIKELY(term_is_integer(gpio_num_term))) {
        avm_int_t pin_int = term_to_int32(gpio_num_term);
        if (UNLIKELY((pin_int < 0) || (pin_int >= GPIO_NUM_MAX))) {
            return BADARG_ATOM;
        }
        gpio_num = (gpio_num_t) pin_int;
    } else {
        return BADARG_ATOM;
    }

    esp_err_t result = gpio_hold_dis(gpio_num);
    if (UNLIKELY(result != ESP_OK)) {
        return BADARG_ATOM;
    }
    return OK_ATOM;
}

static inline term gpio_digital_write(Context *ctx, term gpio_num_term, term level_term)
{
    gpio_num_t gpio_num;
    if (LIKELY(term_is_integer(gpio_num_term))) {
        avm_int_t pin_int = term_to_int32(gpio_num_term);
        if (UNLIKELY((pin_int < 0) || (pin_int >= GPIO_NUM_MAX))) {
            return BADARG_ATOM;
        }
        gpio_num = (gpio_num_t) pin_int;
    } else {
        return BADARG_ATOM;
    }

    int level;
    if (UNLIKELY(!term_is_logic_level(level_term))) {
        return BADARG_ATOM;
    }
    if (term_is_integer(level_term)) {
        level = term_to_int32(level_term);
    } else {
        level = interop_atom_term_select_int(pin_level_table, level_term, ctx->global);
    }

    esp_err_t result = gpio_set_level(gpio_num, level);
    if (UNLIKELY(result != ESP_OK)) {
        return BADARG_ATOM;
    }

    return OK_ATOM;
}

static inline term gpio_digital_read(Context *ctx, term gpio_num_term)
{
    gpio_num_t gpio_num;
    if (LIKELY(term_is_integer(gpio_num_term))) {
        avm_int_t pin_int = term_to_int32(gpio_num_term);
        if (UNLIKELY((pin_int < 0) || (pin_int >= GPIO_NUM_MAX))) {
            return BADARG_ATOM;
        }
        gpio_num = (gpio_num_t) pin_int;
    } else {
        return BADARG_ATOM;
    }

    avm_int_t level = gpio_get_level(gpio_num);

    return level ? HIGH_ATOM : LOW_ATOM;
}

#ifdef CONFIG_AVM_ENABLE_GPIO_PORT_DRIVER

void gpio_driver_init(GlobalContext *global)
{
    int index = globalcontext_insert_atom(global, ATOM_STR("\xB", "gpio_driver"));
    if (UNLIKELY(index < 0 )){
        ESP_LOGE(TAG, "Failed to initialize gpio_driver");
    } else {
        gpio_driver = term_from_atom_index(index);
    }
}

Context *gpio_driver_create_port(GlobalContext *global, term opts)
{
    Context *ctx = context_new(global);

    struct GPIOData *gpio_data = malloc(sizeof(struct GPIOData));
    if (IS_NULL_PTR(gpio_data)) {
        ESP_LOGE(TAG, "Not enough free memory to initialize GPIO port driver!");
        scheduler_terminate(ctx);
        return NULL;
    }
    list_init(&gpio_data->gpio_listeners);

    ctx->native_handler = consume_gpio_mailbox;
    ctx->platform_data = gpio_data;

    int gpio_atom_index = globalcontext_insert_atom(global, ATOM_STR("\x4", "gpio"));
    if (UNLIKELY(gpio_atom_index < 0)) {
        ESP_LOGE(TAG, "Failed to create 'gpio' atom to register the driver!");
        free(gpio_data);
        scheduler_terminate(ctx);
        return NULL;
    }

    if (UNLIKELY(!globalcontext_register_process(ctx->global, gpio_atom_index, ctx->process_id))) {
        ESP_LOGE(TAG, "Only a single GPIO driver can be opened.");
        free(gpio_data);
        scheduler_terminate(ctx);
        return NULL;
    }

    return ctx;
}

static term gpiodriver_close(Context *ctx)
{
    GlobalContext *glb = ctx->global;
    int gpio_atom_index = atom_table_ensure_atom(glb->atom_table, ATOM_STR("\x4", "gpio"), AtomTableNoOpts);
    if (UNLIKELY(!globalcontext_get_registered_process(glb, gpio_atom_index))) {
        port_ensure_available(ctx, TUPLE_SIZE(2));
        return port_create_error_tuple(ctx, NOPROC_ATOM);
    }

    struct GPIOData *gpio_data = ctx->platform_data;

    struct ListHead *item;
    struct ListHead *tmp;
    int32_t gpio_num;
    if (!list_is_empty(&gpio_data->gpio_listeners)) {
        MUTABLE_LIST_FOR_EACH (item, tmp, &gpio_data->gpio_listeners) {
            struct GPIOListenerData *gpio_listener = GET_LIST_ENTRY(item, struct GPIOListenerData, gpio_listener_list_head);
            gpio_num = gpio_listener->gpio;
            list_remove(&gpio_listener->gpio_listener_list_head);
            sys_unregister_listener(ctx->global, &gpio_listener->listener);
            free(gpio_listener);

            gpio_set_intr_type(gpio_num, GPIO_INTR_DISABLE);
            gpio_isr_handler_remove(gpio_num);

            if (list_is_empty(&gpio_data->gpio_listeners)) {
                gpio_uninstall_isr_service();
            }
        }
    }

    ctx->platform_data = NULL;
    globalcontext_unregister_process(glb, gpio_atom_index);
    free(gpio_data);

    return OK_ATOM;
}

EventListener *gpio_interrupt_callback(GlobalContext *glb, EventListener *listener)
{
    struct GPIOListenerData *data = GET_LIST_ENTRY(listener, struct GPIOListenerData, listener);
    int32_t listening_pid = data->target_local_pid;
    int gpio_num = data->gpio;

    // 1 header + 2 elements
    BEGIN_WITH_STACK_HEAP(1 + 2, heap);

    term int_msg = term_alloc_tuple(2, &heap);
    term_put_tuple_element(int_msg, 0, GPIO_INTERRUPT_ATOM);
    term_put_tuple_element(int_msg, 1, term_from_int32(gpio_num));

    globalcontext_send_message(glb, listening_pid, int_msg);

    END_WITH_STACK_HEAP(heap, glb);

    return listener;
}

static term gpiodriver_set_level(Context *ctx, term cmd)
{
    term gpio_num = term_get_tuple_element(cmd, 1);
    term level = term_get_tuple_element(cmd, 2);

    term result = gpio_digital_write(ctx, gpio_num, level);
    if (UNLIKELY(result != OK_ATOM)) {
        port_ensure_available(ctx, TUPLE_SIZE(2));
        return port_create_error_tuple(ctx, result);
    }
    return result;
}

static term gpiodriver_set_direction(Context *ctx, term cmd)
{
    term gpio_num = term_get_tuple_element(cmd, 1);
    term direction = term_get_tuple_element(cmd, 2);

    term result = gpio_set_pin_mode(ctx, gpio_num, direction);
    if (UNLIKELY(result != OK_ATOM)) {
        port_ensure_available(ctx, TUPLE_SIZE(2));
        return port_create_error_tuple(ctx, result);
    }
    return result;
}

