atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/gpio_driver.c
static term gpiodriver_remove_int(Context *ctx, term cmd)
{
    term gpio_num_term = term_get_tuple_element(cmd, 1);
    gpio_num_t gpio_num;
    if (LIKELY(term_is_integer(gpio_num_term))) {
        int32_t pin_int = term_to_int32(gpio_num_term);
        if (UNLIKELY((pin_int < 0) || (pin_int >= GPIO_NUM_MAX))) {
            port_ensure_available(ctx, TUPLE_SIZE(2));
            return port_create_error_tuple(ctx, BADARG_ATOM);
        }
        gpio_num = (gpio_num_t) pin_int;
    } else {
        port_ensure_available(ctx, TUPLE_SIZE(2));
        return port_create_error_tuple(ctx, BADARG_ATOM);
    }


    return unregister_interrupt_listener(ctx, gpio_num);
}

static term create_pair(Context *ctx, term term1, term term2)
{
    term ret = term_alloc_tuple(2, &ctx->heap);
    term_put_tuple_element(ret, 0, term1);
    term_put_tuple_element(ret, 1, term2);

    return ret;
}

static NativeHandlerResult consume_gpio_mailbox(Context *ctx)
{
    Message *message = mailbox_first(&ctx->mailbox);
    GenMessage gen_message;
    if (UNLIKELY(port_parse_gen_message(message->message, &gen_message) != GenCallMessage)) {
        ESP_LOGW(TAG, "Received invalid message.");
        mailbox_remove_message(&ctx->mailbox, &ctx->heap);
        return NativeContinue;
    }

    term cmd_term = term_get_tuple_element(gen_message.req, 0);

    int local_process_id = term_to_local_process_id(gen_message.pid);

    term ret;

    enum gpio_cmd cmd = interop_atom_term_select_int(gpio_cmd_table, cmd_term, ctx->global);
    switch (cmd) {
        case GPIOSetLevelCmd:
            ret = gpiodriver_set_level(ctx, gen_message.req);
            break;

        case GPIOSetDirectionCmd:
            ret = gpiodriver_set_direction(ctx, gen_message.req);
            break;

        case GPIOReadCmd:
            ret = gpiodriver_read(ctx, gen_message.req);
            break;

        case GPIOSetIntCmd:
            ret = gpiodriver_set_int(ctx, local_process_id, gen_message.req);
            break;

        case GPIORemoveIntCmd:
            ret = gpiodriver_remove_int(ctx, gen_message.req);
            break;

        case GPIOCloseCmd:
            ret = gpiodriver_close(ctx);
            break;

        default:
            ESP_LOGW(TAG, "Unrecognized command");
            port_ensure_available(ctx, TUPLE_SIZE(2));
            ret = port_create_error_tuple(ctx, BADARG_ATOM);
    }

    term ret_msg;
    if (UNLIKELY(memory_ensure_free_with_roots(ctx, 3, 1, &ret, MEMORY_CAN_SHRINK) != MEMORY_GC_OK)) {
        ret_msg = OUT_OF_MEMORY_ATOM;
    } else {
        ret_msg = create_pair(ctx, gen_message.ref, ret);
    }

    globalcontext_send_message(ctx->global, local_process_id, ret_msg);
    mailbox_remove_message(&ctx->mailbox, &ctx->heap);

    return cmd == GPIOCloseCmd ? NativeTerminate : NativeContinue;
}

static void IRAM_ATTR gpio_isr_handler(void *arg)
{
    xQueueSendFromISR(event_queue, &arg, NULL);
}

REGISTER_PORT_DRIVER(gpio, gpio_driver_init, NULL, gpio_driver_create_port)

#endif

//
// Nif implementation
//

#ifdef CONFIG_AVM_ENABLE_GPIO_NIFS


static term nif_gpio_init(Context *ctx, int argc, term argv[])
{
    UNUSED(argc);

    gpio_num_t gpio_num;
    if (LIKELY(term_is_integer(argv[0]))) {
        avm_int_t pin_int = term_to_int32(argv[0]);
        if (UNLIKELY((pin_int < 0) || (pin_int >= GPIO_NUM_MAX))) {
            RAISE_ERROR(BADARG_ATOM);
        }
        gpio_num = (gpio_num_t) pin_int;
    } else {
        RAISE_ERROR(BADARG_ATOM);
    }

    gpio_config_t config = {};
    config.pin_bit_mask = 1ULL << gpio_num;
    config.mode = GPIO_MODE_DISABLE;
    config.pull_up_en = GPIO_PULLUP_DISABLE;
    config.pull_down_en = GPIO_PULLDOWN_DISABLE;
    config.intr_type = GPIO_INTR_DISABLE;

    esp_err_t result = gpio_config(&config);

    if (UNLIKELY(result != ESP_OK)) {
        RAISE_ERROR(BADARG_ATOM);
    }

    return OK_ATOM;
}

static term nif_gpio_set_pin_mode(Context *ctx, int argc, term argv[])
{
    UNUSED(argc);

    term result = gpio_set_pin_mode(ctx, argv[0], argv[1]);
    if (UNLIKELY(result != OK_ATOM)) {
        RAISE_ERROR(result);
    }

    return result;
}

static term nif_gpio_set_pin_pull(Context *ctx, int argc, term argv[])
{
    UNUSED(argc);

    term result = set_pin_pull_mode(ctx, argv[0], argv[1]);
    if (UNLIKELY(result != OK_ATOM)) {
        RAISE_ERROR(result);
    }

    return result;
}

static term nif_gpio_hold_en(Context *ctx, int argc, term argv[])
{
    UNUSED(ctx);
    UNUSED(argc);

    term result = hold_en(argv[0]);
    if (UNLIKELY(result != OK_ATOM)) {
        RAISE_ERROR(result);
    }

    return result;
}

static term nif_gpio_hold_dis(Context *ctx, int argc, term argv[])
{
    UNUSED(ctx);
    UNUSED(argc);

    term result = hold_dis(argv[0]);
    if (UNLIKELY(result != OK_ATOM)) {
        RAISE_ERROR(result);
    }

    return result;
}

#if (ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 2) && SOC_GPIO_SUPPORT_HOLD_IO_IN_DSLP && !SOC_GPIO_SUPPORT_HOLD_SINGLE_IO_IN_DSLP) || (ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 3, 2) && !SOC_GPIO_SUPPORT_HOLD_SINGLE_IO_IN_DSLP)
static term nif_gpio_deep_sleep_hold_en(Context *ctx, int argc, term argv[])
{
    UNUSED(ctx);
    UNUSED(argc);
    UNUSED(argv);

    gpio_deep_sleep_hold_en();
    return OK_ATOM;
}

static term nif_gpio_deep_sleep_hold_dis(Context *ctx, int argc, term argv[])
{
    UNUSED(ctx);
    UNUSED(argc);
    UNUSED(argv);

    gpio_deep_sleep_hold_dis();
    return OK_ATOM;
}
#endif

static term nif_gpio_digital_write(Context *ctx, int argc, term argv[])
{
    term result = gpio_digital_write(ctx, argv[0], argv[1]);
    if (UNLIKELY(result != OK_ATOM)) {
        RAISE_ERROR(result);
    }
    return result;
}

static term nif_gpio_digital_read(Context *ctx, int argc, term argv[])
{
    term result = gpio_digital_read(ctx, argv[0]);
    if (LIKELY(term_is_logic_level(result))) {
        return result;
    } else {
        RAISE_ERROR(result);
    }
}

static const struct Nif gpio_init_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_gpio_init
};

